## 第二章 Python数据分析简介
Python是一门简单易学且功能强大的编程语言，拥有高级数据结构，并且能够高效面向对象的进行编程。Python是一门编程语言；开发效率显著，Python被誉为胶水，因为其可以融合C/C++语言，可以解决Python的运行效率，其实Python的运行效率 与C/C++语言相媲美；随着程序库的开发，未来Python将成为主流语言。
#### 2.1 搭建Python开发平台
#### 2.2 Python使用入门
运行方式：有两种形式，第一种是在在命令窗口直接输命令语句，第二种是把完整代码写成.py文件，然后执行<br>
基本命令：基本运算、判断与循环、函数<br>
		数据结构：列表、元组、字典、集合统称为容器<br>
库的导入与添加：我们需要把库模块加载进来以提高Python的速度。例如import math
			导入库有三种方法，一种是直接利用import进行导入。第二种是利用from 库名 import 函数名，此方法应用于不导入所有方法，第三种可以给导入的库进行命名，比如import math as m.用的时候就用m调用相关方法。
导入future库：对于python 2来说print直接输出相关变量，对于python 3版本来说，print（a）把其当成一个模块进行输出，针对这一点，我们可以导入相关库使得python2与python3一致。
From _future_ import print_function
添加第三方库：参考2.3.1
#### 2.3 Python数据分析工具
Python本身数据分析功能不强，需要添加第三方数据库增加其功能，本书用到的库有Numpy（提供数组支持，以及相应的高效的处理函数）、Scipy（提供矩阵支持，以及矩阵相关的数据计算模块）、Matsplotlib（强大的可视化模块，做图库）、pandas（强大、灵活的数据分析和探索工具）、Scikit_learn（支持回归、聚集、分类等强大的机器学习库）。StatsModels(统计建模和计量经济学、包括描述统计、统计模型估计和推测)Keras（深度学习库、用于建立深度网络和深度学习模型）Gisim（用于文本主题模型的库、文本挖掘可以用的到）本书会对这些库做一些基本的讲解，如果想要详细了解，去官网找到相关的帮助文档进行深入学习，限于文本篇幅，只介绍了一些库，还有一些库没有介绍，我们可以搜索相关知识进行解决
#### 2.3.1Numpy
Python内部虽然有数组，但当数据量较大时用python就比较慢，Numpy处理速度是C语言级别的。因此编程时，尽量使用内置函数进行处理数组以免发生瓶颈。
